// Створюємо об'єкт
let monitor = {
    brand: 'Dell',
    size: '27 дюймів',
    resolution: '2560x1440',
    
    // отримання інформації про об'єкт
    getInfo: function() {
      // змінна для зберігання інформації
      let info = '';
      // Перебираємо всі властивості
      for (let key in this) {
        // Перевіряємо, чи властивість не є методом
        if (typeof this[key] !== 'function') {
          // Додаємо пару "ключ: значення" до інформації
          info += `${key}: ${this[key]}\n`;
        }
      }
      // Виводимо інформацію
      console.log(info);
    }
  };
  
  // Правильна інформація про об'єкт
  monitor.getInfo();
  
// Додаємо нову властивість
  monitor.defects = '4 биті пікселі';
  
  // Виводить всі властивості, включаючи щойно додану
  monitor.getInfo();